<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"tts-10x-forms-demo","backend":"44bae09b4cd7ea1a070e1194499ad7af9a1e539d2083885d59fc1ee2e36f3013","plan_job_ref":"Job Post Terraform plan to PR comment #607 at https://github.com/GSA-TTS/forms/actions/runs/12777001642","plan_out_hash":"aca9c27ee3ca46262ce38e049607080ba0a51890d5c104c86f364d7cabde6657","plan_hash":"f7aa2267c597c2225131e47b76da577dc54ee0ce1e2b91df370c6ced6729ce16","plan_text_format":"diff","version":"1.46.0"} -->
Terraform plan for __tts-10x-forms-demo__
<details>
<summary>Plan: 8 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-forms-demo-server-doj_tts-10x-forms-demo-server-doj-app_88F24765 will be created
+   resource "cloudfoundry_app" "tts-10x-forms-demo-server-doj_tts-10x-forms-demo-server-doj-app_88F24765" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/forms/server-doj:39fec5d44f745e0a5bc47a57f272e5e46bf1c296"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-forms-demo-server-doj-app"
+       ports                           = (known after apply)
+       space                           = "c003594e-9b13-43ec-b8ef-723393d44dba"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

+       service_binding {
+           service_instance = (known after apply)
        }
+       service_binding {
+           service_instance = (known after apply)
        }
    }

  # cloudfoundry_app.tts-10x-forms-demo-server-kansas_tts-10x-forms-demo-server-kansas-app_8866F530 will be created
+   resource "cloudfoundry_app" "tts-10x-forms-demo-server-kansas_tts-10x-forms-demo-server-kansas-app_8866F530" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/forms/server-kansas:39fec5d44f745e0a5bc47a57f272e5e46bf1c296"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-forms-demo-server-kansas-app"
+       ports                           = (known after apply)
+       space                           = "c003594e-9b13-43ec-b8ef-723393d44dba"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

+       service_binding {
+           service_instance = (known after apply)
        }
+       service_binding {
+           service_instance = (known after apply)
        }
    }

  # cloudfoundry_route.tts-10x-forms-demo-server-doj_tts-10x-forms-demo-server-doj-route_77667FF5 will be created
+   resource "cloudfoundry_route" "tts-10x-forms-demo-server-doj_tts-10x-forms-demo-server-doj-route_77667FF5" {
+       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
+       endpoint = (known after apply)
+       hostname = "tts-10x-forms-demo-server-doj"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "c003594e-9b13-43ec-b8ef-723393d44dba"
    }

  # cloudfoundry_route.tts-10x-forms-demo-server-kansas_tts-10x-forms-demo-server-kansas-route_A03E024D will be created
+   resource "cloudfoundry_route" "tts-10x-forms-demo-server-kansas_tts-10x-forms-demo-server-kansas-route_A03E024D" {
+       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
+       endpoint = (known after apply)
+       hostname = "tts-10x-forms-demo-server-kansas"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "c003594e-9b13-43ec-b8ef-723393d44dba"
    }

  # cloudfoundry_service_instance.tts-10x-forms-demo-server-doj_tts-10x-forms-demo-server-doj-db_13A80C4E will be created
+   resource "cloudfoundry_service_instance" "tts-10x-forms-demo-server-doj_tts-10x-forms-demo-server-doj-db_13A80C4E" {
+       id                             = (known after apply)
+       json_params                    = jsonencode(
            {
+               version = "15"
            }
        )
+       name                           = "tts-10x-forms-demo-server-doj-db"
+       replace_on_params_change       = false
+       replace_on_service_plan_change = false
+       service_plan                   = "5ed9f319-4c75-4851-9885-598a96b7febc"
+       space                          = "c003594e-9b13-43ec-b8ef-723393d44dba"

+       timeouts {
+           create = "60m"
+           delete = "2h"
+           update = "60m"
        }
    }

  # cloudfoundry_service_instance.tts-10x-forms-demo-server-kansas_tts-10x-forms-demo-server-kansas-db_D819190D will be created
+   resource "cloudfoundry_service_instance" "tts-10x-forms-demo-server-kansas_tts-10x-forms-demo-server-kansas-db_D819190D" {
+       id                             = (known after apply)
+       json_params                    = jsonencode(
            {
+               version = "15"
            }
        )
+       name                           = "tts-10x-forms-demo-server-kansas-db"
+       replace_on_params_change       = false
+       replace_on_service_plan_change = false
+       service_plan                   = "5ed9f319-4c75-4851-9885-598a96b7febc"
+       space                          = "c003594e-9b13-43ec-b8ef-723393d44dba"

+       timeouts {
+           create = "60m"
+           delete = "2h"
+           update = "60m"
        }
    }

  # cloudfoundry_user_provided_service.tts-10x-forms-demo-server-doj_tts-10x-forms-demo-server-doj-login-gov-service_227695D4 will be created
+   resource "cloudfoundry_user_provided_service" "tts-10x-forms-demo-server-doj_tts-10x-forms-demo-server-doj-login-gov-service_227695D4" {
+       credentials = (sensitive value)
+       id          = (known after apply)
+       name        = "tts-10x-forms-demo-server-doj-login-gov-service"
+       space       = "c003594e-9b13-43ec-b8ef-723393d44dba"
    }

  # cloudfoundry_user_provided_service.tts-10x-forms-demo-server-kansas_tts-10x-forms-demo-server-kansas-login-gov-service_06481694 will be created
+   resource "cloudfoundry_user_provided_service" "tts-10x-forms-demo-server-kansas_tts-10x-forms-demo-server-kansas-login-gov-service_06481694" {
+       credentials = (sensitive value)
+       id          = (known after apply)
+       name        = "tts-10x-forms-demo-server-kansas-login-gov-service"
+       space       = "c003594e-9b13-43ec-b8ef-723393d44dba"
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Post Terraform plan to PR comment #607](https://github.com/GSA-TTS/forms/actions/runs/12777001642)